{
    "ancestries": [
        {
            "dwarf": [
                {
                    "feat_name" : "Ancestral Hatred",
                    "feat_level" : 1,
                    "acting_and_effects" : "",
                    "feat_trait" : "Dwarf",
                    "feat_prerequisits" : "",
                    "feat_trigger" : "",
                    "feat_description" : "You have shaped your hatred of ancestral dwarven foes into a powerful weapon. Choose two of the following creature traits: derro, duergar, giant, or orc. You gain a +1 circumstance bonus to damage rolls against creatures with one of the chosen traits. If a creature with a chosen trait critically succeeds at an attack against you, this bonus increases to +4 against that creature for 1 minute. Special Your GM can add appropriate creature traits to this list if your character is from a community that commonly fights other types of enemies.",
                    "feat_frequency" : "",
                    "feat_special" : "",
                    "feat_max_stacks" : 1
                },
                {
                    "feat_name" : "Ancient's Blood",
                    "feat_level" : 1,
                    "acting_and_effects" : "Reaction",
                    "feat_trait" : "Dwarf, Heritage",
                    "feat_prerequisits" : "",
                    "feat_trigger" : "You attempt a saving throw against a magical effect.",
                    "feat_description" : "Your ancestors’ innate resistance to magic has manifested in you. You gain a +2 circumstance bonus to the triggering saving throw. Special Your resistance hampers your connection to magic items. Reduce your total Resonance Points by 2 (minimum 0). For more information about Resonance Points, see page 376.",
                    "feat_frequency" : "",
                    "feat_special" : "",
                    "feat_max_stacks" : 1
                },
                {
                    "feat_name" : "Boulder Roll",
                    "feat_level" : 5,
                    "acting_and_effects" : "2 Actions",
                    "feat_trait" : "Dwarf",
                    "feat_prerequisits" : "Mountain Roots",
                    "feat_trigger" : "",
                    "feat_description" : "Your dwarven build allows you to push foes around. Take a Step into the square of a foe that is your size or smaller, and the foe must move into the empty space directly behind it. The foe must move even if doing so places it in harm’s way. The foe can attempt to block your Step by rolling a Fortitude saving throw against your Athletics DC. If the foe attempts this saving throw, regardless of the saving throw’s result, the creature takes bludgeoning damage equal to your level plus your Strength modifier. If the foe can’t move into an empty space (if it is surrounded by solid objects or other creatures, for example), your Boulder Roll has no effect.",
                    "feat_frequency" : "",
                    "feat_special" : "",
                    "feat_max_stacks" : 1
                },
                {
                    "feat_name" : "Giant Bane",
                    "feat_level" : 1,
                    "acting_and_effects" : "",
                    "feat_trait" : "Dwarf",
                    "feat_prerequisits" : "",
                    "feat_trigger" : "",
                    "feat_description" : "Your squat stature and your hatred for giantkind give you an edge when fighting them. You gain a +1 circumstance bonus to your Armor Class against giants; Fortitude and Reflex DCs against giants’ attempts to Disarm, Grapple, Shove, or Trip you; Survival checks to track giants; Perception checks to notice giants; and Stealth checks to avoid being noticed by giants.",
                    "feat_frequency" : "",
                    "feat_special" : "",
                    "feat_max_stacks" : 1
                },
                {
                    "feat_name" : "Hardy",
                    "feat_level" : 1,
                    "acting_and_effects" : "",
                    "feat_trait" : "Dwarf, Heritage",
                    "feat_prerequisits" : "",
                    "feat_trigger" : "",
                    "feat_description" : "Your squat stature and your hatred for giantkind give you an edge when fighting them. You gain a +1 circumstance bonus to your Armor Class against giants; Fortitude and Reflex DCs against giants’ attempts to Disarm, Grapple, Shove, or Trip you; Survival checks to track giants; Perception checks to notice giants; and Stealth checks to avoid being noticed by giants.",
                    "feat_frequency" : "",
                    "feat_special" : "",
                    "feat_max_stacks" : 1
                },
                {
                    "feat_name" : "Mountain Roots",
                    "feat_level" : 1,
                    "acting_and_effects" : "",
                    "feat_trait" : "Dwarf",
                    "feat_prerequisits" : "",
                    "feat_trigger" : "",
                    "feat_description" : "You can plant your feet on the ground to become nearly immovable. You gain a +2 circumstance bonus to your Fortitude or Reflex DC whenever anyone attempts to Shove or Trip you. This bonus also applies to saves against spells or effects that attempt to knock you prone. In addition, if any ability or effect would force you to move 10 feet or more in any direction, you are moved only half the distance.",
                    "feat_frequency" : "",
                    "feat_special" : "",
                    "feat_max_stacks" : 1
                },
                {
                    "feat_name" : "Rock Runner",
                    "feat_level" : 1,
                    "acting_and_effects" : "",
                    "feat_trait" : "Dwarf",
                    "feat_prerequisits" : "",
                    "feat_trigger" : "",
                    "feat_description" : "Your innate connection to stone makes you adept at moving across uneven surfaces. When you take the Step action, you can ignore difficult terrain caused by uneven ground made of stone and earth. In addition, when you use the Acrobatics skill to Balance (see page 144) on narrow surfaces or uneven ground made of stone or earth, you aren’t flat-footed, and you treat a success on the Acrobatics check as if it were a critical success.",
                    "feat_frequency" : "",
                    "feat_special" : "",
                    "feat_max_stacks" : 1
                },
                {
                    "feat_name" : "Stonecutting",
                    "feat_level" : 1,
                    "acting_and_effects" : "",
                    "feat_trait" : "Dwarf",
                    "feat_prerequisits" : "",
                    "feat_trigger" : "",
                    "feat_description" : "You have a knack for noticing inconsistencies and craftsmanship techniques in the stonework around you. You gain a +2 circumstance bonus to Perception checks to notice unusual stonework. This bonus applies to checks to discover mechanical traps made of stone or hidden inside of stone. If you aren’t using the Seek action (see page 308) or searching, the GM rolls a secret check without the bonus and with a –2 circumstance penalty for you to notice unusual stonework anyway (in such cases, this feat takes on the secret trait).",
                    "feat_frequency" : "",
                    "feat_special" : "",
                    "feat_max_stacks" : 1
                },
                {
                    "feat_name" : "Weapon Cunning (Dwarf)",
                    "feat_level" : 5,
                    "acting_and_effects" : "",
                    "feat_trait" : "Dwarf",
                    "feat_prerequisits" : "Weapon Familiarity (Dwarf)",
                    "feat_trigger" : "",
                    "feat_description" : "Whenever you critically hit using a weapon of the axe, hammer, or pick group, you apply the weapon’s critical specialization effect.",
                    "feat_frequency" : "",
                    "feat_special" : "",
                    "feat_max_stacks" : 1
                },
                {
                    "feat_name" : "Weapon Familiarity (Dwarf)",
                    "feat_level" : 1,
                    "acting_and_effects" : "",
                    "feat_trait" : "Dwarf",
                    "feat_prerequisits" : "",
                    "feat_trigger" : "",
                    "feat_description" : "Your kin have instilled in you an affinity for hard- hitting weapons, and you prefer them to more elegant arms. You are trained with the battleaxe, pick, and warhammer. In addition, you gain access to all uncommon dwarf weapons. For the purpose of proficiencies, you treat martial dwarf weapons as simple weapons and exotic dwarf weapons as martial weapons. More about weapons can be found on page 178.",
                    "feat_frequency" : "",
                    "feat_special" : "",
                    "feat_max_stacks" : 1
                }
            ],
            "elf": [
                {
                    "feat_name" : "Ageless Patience",
                    "feat_level" : 1,
                    "acting_and_effects" : "",
                    "feat_trait" : "Elf",
                    "feat_prerequisits" : "",
                    "feat_trigger" : "",
                    "feat_description" : "You move at a pace born from longevity that might infuriate your shorter-lived comrades but enhances your thoroughness. You can spend twice as much downtime as usual on a downtime activity to receive a +2 circumstance bonus to all checks related to that downtime activity. For more about downtime, see page 318.",
                    "feat_frequency" : "",
                    "feat_special" : "",
                    "feat_max_stacks" : 1
                },
                {
                    "feat_name" : "Ancestral Longevity",
                    "feat_level" : 1,
                    "acting_and_effects" : "",
                    "feat_trait" : "Elf",
                    "feat_prerequisits" : "",
                    "feat_trigger" : "",
                    "feat_description" : "You have accumulated a vast array of lived knowledge over your long life. During your daily preparations (see page 317), you can reflect upon your life experiences to become trained in one skill of your choice. This proficiency lasts until you prepare again. More about skills and proficiency can be found on page 142.",
                    "feat_frequency" : "",
                    "feat_special" : "",
                    "feat_max_stacks" : 1
                },
                {
                    "feat_name" : "Demon Skirmisher",
                    "feat_level" : 1,
                    "acting_and_effects" : "",
                    "feat_trait" : "Elf",
                    "feat_prerequisits" : "",
                    "feat_trigger" : "",
                    "feat_description" : "You have served in the fight to reclaim your homeland from demons, and thus you have learned to mitigate those fiends’ strengths and amplify their weaknesses. Your attacks treat demons’ resistances as if they were 1 lower and demons’ weaknesses as if they were 1 higher. If you use the Stride action on your turn, you instead treat demons’ resistances as 2 lower and their weaknesses as 2 higher until the end of your turn.",
                    "feat_frequency" : "",
                    "feat_special" : "",
                    "feat_max_stacks" : 1
                },
                {
                    "feat_name" : "Forlorn",
                    "feat_level" : 1,
                    "acting_and_effects" : "",
                    "feat_trait" : "Elf",
                    "feat_prerequisits" : "",
                    "feat_trigger" : "",
                    "feat_description" : "Watching your friends age and die fills you with moroseness that girds you against harmful emotions. You gain a +1 circumstance bonus to saves against emotion effects. If you succeed at a saving throw against an emotion effect, treat it as a critical success instead.",
                    "feat_frequency" : "",
                    "feat_special" : "",
                    "feat_max_stacks" : 1
                },
                {
                    "feat_name" : "Keen Hearing",
                    "feat_level" : 1,
                    "acting_and_effects" : "",
                    "feat_trait" : "Elf, Heritage",
                    "feat_prerequisits" : "",
                    "feat_trigger" : "",
                    "feat_description" : "Your ears are finely tuned to even the slightest whispers of sound. As long as you can hear normally, you can use the Seek action to sense unseen creatures in a 60-foot cone instead of a 30-foot cone. You also gain a +2 circumstance bonus to sense unseen creatures within 30 feet that you can hear with a Seek action.",
                    "feat_frequency" : "",
                    "feat_special" : "",
                    "feat_max_stacks" : 1
                },
                {
                    "feat_name" : "Nimble",
                    "feat_level" : 1,
                    "acting_and_effects" : "",
                    "feat_trait" : "Elf",
                    "feat_prerequisits" : "",
                    "feat_trigger" : "",
                    "feat_description" : "Your reflexes and lithe muscles are tightly honed. Your Speed increases by 5 feet. Additionally, when you use the Stride action, you can ignore difficult terrain in one square during that move.",
                    "feat_frequency" : "",
                    "feat_special" : "",
                    "feat_max_stacks" : 1
                },
                {
                    "feat_name" : "Otherworldly Magic",
                    "feat_level" : 1,
                    "acting_and_effects" : "",
                    "feat_trait" : "Elf",
                    "feat_prerequisits" : "",
                    "feat_trigger" : "",
                    "feat_description" : "Choose one cantrip from the arcane spell list (see page 199). You can cast this cantrip as an innate arcane spell at will. The cantrip is heightened to a spell level equal to half your level rounded up. You can learn more about spells on page 192.",
                    "feat_frequency" : "",
                    "feat_special" : "",
                    "feat_max_stacks" : 1
                },
                {
                    "feat_name" : "Unwavering Mien",
                    "feat_level" : 1,
                    "acting_and_effects" : "",
                    "feat_trait" : "Elf",
                    "feat_prerequisits" : "",
                    "feat_trigger" : "",
                    "feat_description" : "Your mystic control and meditation allow you to resist external influences upon your consciousness. When you would be confused, frightened, or stupefied for at least 2 rounds, reduce the duration by 1 round. You still require natural sleep, but you are immune to effects that would cause you to fall asleep. This protects only against the asleep condition, not against other forms of falling unconscious.",
                    "feat_frequency" : "",
                    "feat_special" : "",
                    "feat_max_stacks" : 1
                },
                {
                    "feat_name" : "Weapon Elegance (Elf)",
                    "feat_level" : 5,
                    "acting_and_effects" : "",
                    "feat_trait" : "Elf",
                    "feat_prerequisits" : "Weapon Familiarity (Elf)",
                    "feat_trigger" : "",
                    "feat_description" : "You are attuned to the weapons of your elf ancestors and are particularly deadly when using them. Whenever you critically hit using a weapon of the bow or sword group, you apply the weapon’s critical specialization effect.",
                    "feat_frequency" : "",
                    "feat_special" : "",
                    "feat_max_stacks" : 1
                },
                {
                    "feat_name" : "Weapon Familiarity (Elf)",
                    "feat_level" : 1,
                    "acting_and_effects" : "",
                    "feat_trait" : "Elf",
                    "feat_prerequisits" : "",
                    "feat_trigger" : "",
                    "feat_description" : "You favor bows and elegant weapons. You are trained with longbows, composite longbows, longswords, rapiers, shortbows, and composite shortbows. In addition, you gain access to all uncommon elf weapons. For the purpose of proficiencies, you treat martial elf weapons as simple weapons and exotic elf weapons as martial weapons. More about weapons can be found on page 178.",
                    "feat_frequency" : "",
                    "feat_special" : "",
                    "feat_max_stacks" : 1
                }
            ],
            "gnome": [
                {
                    "feat_name" : "Animal Accomplice",
                    "feat_level" : 1,
                    "acting_and_effects" : "",
                    "feat_trait" : "Gnome",
                    "feat_prerequisits" : "",
                    "feat_trigger" : "",
                    "feat_description" : "A rapport develops between you and an animal, which becomes magically bonded to you. You gain a familiar (see page 287). The type of animal is up to you, but most gnomes choose animals with a burrow Speed.",
                    "feat_frequency" : "",
                    "feat_special" : "",
                    "feat_max_stacks" : 1
                },
                {
                    "feat_name" : "Animal Speaker",
                    "feat_level" : 1,
                    "acting_and_effects" : "",
                    "feat_trait" : "Gnome",
                    "feat_prerequisits" : "",
                    "feat_trigger" : "",
                    "feat_description" : "You recognize the chittering of ground creatures as a language of its own. You can ask questions of, receive answers from, and use the Diplomacy skill with animals that have a burrow Speed, such as badgers, ground squirrels, moles, and prairie dogs. The GM determines which animals count for this ability.",
                    "feat_frequency" : "",
                    "feat_special" : "",
                    "feat_max_stacks" : 1
                },
                {
                    "feat_name" : "Animal Whisperer",
                    "feat_level" : 5,
                    "acting_and_effects" : "",
                    "feat_trait" : "Gnome",
                    "feat_prerequisits" : "Animal Speaker",
                    "feat_trigger" : "",
                    "feat_description" : "You hear the sounds of animals as conversations instead of unintelligent noise. You can speak to all animals, not just animals with a burrow Speed. You gain a +1 circumstance bonus on Diplomacy checks to Make an Impression on animals.",
                    "feat_frequency" : "",
                    "feat_special" : "",
                    "feat_max_stacks" : 1
                },
                {
                    "feat_name" : "Discerning Smell",
                    "feat_level" : 1,
                    "acting_and_effects" : "",
                    "feat_trait" : "Gnome, Heritage",
                    "feat_prerequisits" : "",
                    "feat_trigger" : "",
                    "feat_description" : "You can smell and taste all sorts of exotic flavors that are too nuanced for a human palate. You gain a +2 circumstance bonus to sense an unseen creature that is close enough for you to smell (typically within 30 feet, though halve the distance if you are upwind and double the distance if you are downwind). For more information about senses, see page 301.",
                    "feat_frequency" : "",
                    "feat_special" : "",
                    "feat_max_stacks" : 1
                },
                {
                    "feat_name" : "Fey Fellowship",
                    "feat_level" : 1,
                    "acting_and_effects" : "",
                    "feat_trait" : "Gnome",
                    "feat_prerequisits" : "",
                    "feat_trigger" : "",
                    "feat_description" : "Your fey origins afford you a warmer reception from creatures of the First World as well as tools to foil their tricks. Against fey creatures, you gain a +1 circumstance bonus to Diplomacy checks, Perception checks, and saving throws.",
                    "feat_frequency" : "",
                    "feat_special" : "",
                    "feat_max_stacks" : 1
                },
                {
                    "feat_name" : "First World Magic",
                    "feat_level" : 1,
                    "acting_and_effects" : "",
                    "feat_trait" : "Gnome",
                    "feat_prerequisits" : "",
                    "feat_trigger" : "",
                    "feat_description" : "Choose one cantrip from the primal spell list (see page 201). You can cast this spell as an innate primal spell at will. The cantrip is heightened to a spell level equal to half your level rounded up. For more information about spells, see page 192.",
                    "feat_frequency" : "",
                    "feat_special" : "",
                    "feat_max_stacks" : 1
                },
                {
                    "feat_name" : "Illusion Sense",
                    "feat_level" : 1,
                    "acting_and_effects" : "",
                    "feat_trait" : "Gnome",
                    "feat_prerequisits" : "",
                    "feat_trigger" : "",
                    "feat_description" : "Your ancestors spent their days cloaked and cradled in illusions, and sensing this magic is second nature to you. You gain a +1 circumstance bonus to Perception checks and Will saves against illusions. When you come within 10 feet of an illusion that can be disbelieved, you can attempt a single Perception check to disbelieve it, even without spending an action to interact with it in some way. For more about disbelieving illusions, see page 194.",
                    "feat_frequency" : "",
                    "feat_special" : "",
                    "feat_max_stacks" : 1
                },
                {
                    "feat_name" : "Obsessive",
                    "feat_level" : 1,
                    "acting_and_effects" : "",
                    "feat_trait" : "Gnome",
                    "feat_prerequisits" : "",
                    "feat_trigger" : "",
                    "feat_description" : "You might have a flighty nature, but when a topic captures your attention, you dive into it headfirst. Pick a category of the Lore skill. You are trained in that skill. At 2nd level you become an expert, at 7th level you become a master, and at 15th level you become legendary.",
                    "feat_frequency" : "",
                    "feat_special" : "",
                    "feat_max_stacks" : 1
                },
                {
                    "feat_name" : "Weapon Familiarity (Gnome)",
                    "feat_level" : 1,
                    "acting_and_effects" : "",
                    "feat_trait" : "Gnome",
                    "feat_prerequisits" : "",
                    "feat_trigger" : "",
                    "feat_description" : "You favor unusual weapons tied to your people, such as blades with curved and unusual shapes. You are trained with glaives and kukris. In addition, you gain access to all uncommon gnome weapons. For the purpose of proficiencies, you treat martial gnome weapons as simple weapons and exotic gnome weapons as martial weapons. For more information about weapons, see page 178.",
                    "feat_frequency" : "",
                    "feat_special" : "",
                    "feat_max_stacks" : 1
                },
                {
                    "feat_name" : "Weapon Innovator (Gnome)",
                    "feat_level" : 5,
                    "acting_and_effects" : "",
                    "feat_trait" : "Gnome",
                    "feat_prerequisits" : "Weapon Familiarity (Gnome)",
                    "feat_trigger" : "",
                    "feat_description" : "You produce outstanding results when wielding unusual weapons. Whenever you critically hit using a glaive, kukri, or gnome weapon, you apply the weapon’s critical specialization effect.",
                    "feat_frequency" : "",
                    "feat_special" : "",
                    "feat_max_stacks" : 1
                }
            ],
            "goblin": [
                {
                    "feat_name" : "Burn It",
                    "feat_level" : 1,
                    "acting_and_effects" : "",
                    "feat_trait" : "Goblin",
                    "feat_prerequisits" : "",
                    "feat_trigger" : "",
                    "feat_description" : "Fire fascinates you. Your spells and alchemical items that deal fire damage gain a conditional bonus to damage equal to half the spell’s level or the item’s level (minimum 1). You also gain a +1 conditional bonus to any persistent fire damage you deal, whether it’s from a spell or not.",
                    "feat_frequency" : "",
                    "feat_special" : "",
                    "feat_max_stacks" : 1
                },
                {
                    "feat_name" : "City Scavenger",
                    "feat_level" : 1,
                    "acting_and_effects" : "",
                    "feat_trait" : "Goblin",
                    "feat_prerequisits" : "",
                    "feat_trigger" : "",
                    "feat_description" : "You know that the greatest treasures often look like refuse, and you scoff at those who throw away perfectly good scraps. You can attempt a Survival check to search for food and supplies and to subsist in a city as well as in the wild. When you do, you gain a +1 circumstance bonus to your Survival check.",
                    "feat_frequency" : "",
                    "feat_special" : "",
                    "feat_max_stacks" : 1
                },
                {
                    "feat_name" : "Eat Anything",
                    "feat_level" : 1,
                    "acting_and_effects" : "",
                    "feat_trait" : "Goblin",
                    "feat_prerequisits" : "",
                    "feat_trigger" : "",
                    "feat_description" : "You are comfortable subsisting on food that most folks would consider spoiled. You gain a +2 circumstance bonus to saving throws against toxins and against gaining the sick condition, but only if it resulted from something you ate. You can eat and drink things when you have the sick condition.",
                    "feat_frequency" : "",
                    "feat_special" : "",
                    "feat_max_stacks" : 1
                },
                {
                    "feat_name" : "Flame Heart",
                    "feat_level" : 1,
                    "acting_and_effects" : "",
                    "feat_trait" : "Goblin, Heritage",
                    "feat_prerequisits" : "",
                    "feat_trigger" : "",
                    "feat_description" : "As a result of either a childhood accident with flames or an ongoing fascination with fire, your skin has thickened, protecting you against burning. You gain resistance to fire equal to half your level (minimum 1), and your flat check to remove persistent fire damage (see page 323) is DC 15 instead of DC 20 without requiring an action to reduce the DC.",
                    "feat_frequency" : "",
                    "feat_special" : "",
                    "feat_max_stacks" : 1
                },
                {
                    "feat_name" : "Junk Tinker",
                    "feat_level" : 1,
                    "acting_and_effects" : "",
                    "feat_trait" : "Goblin",
                    "feat_prerequisits" : "",
                    "feat_trigger" : "",
                    "feat_description" : "You can make useful tools out of even the most twisted or rusted scraps. You can craft ordinary items, including weapons but not armor, out of junk. This costs one-quarter the usual amount for a standard-quality item but always results in an item of poor quality. You take only a –1 item penalty when using poor-quality items you crafted. For more information about crafting items, see page 147.",
                    "feat_frequency" : "",
                    "feat_special" : "",
                    "feat_max_stacks" : 1
                },
                {
                    "feat_name" : "Razor Teeth",
                    "feat_level" : 1,
                    "acting_and_effects" : "",
                    "feat_trait" : "Goblin, Heritage",
                    "feat_prerequisits" : "",
                    "feat_trigger" : "",
                    "feat_description" : "Your teeth are formidable weapons. You gain a jaws unarmed attack that deals 1d6 piercing damage. For more information about unarmed attacks, see page 178.",
                    "feat_frequency" : "",
                    "feat_special" : "",
                    "feat_max_stacks" : 1
                },
                {
                    "feat_name" : "Rough Rider",
                    "feat_level" : 1,
                    "acting_and_effects" : "",
                    "feat_trait" : "Goblin",
                    "feat_prerequisits" : "",
                    "feat_trigger" : "",
                    "feat_description" : "Any creature that will bear your weight can become your loyal steed, and you know how to coax even the strangest beasts into service. You gain the Ride feat, even if you don’t meet the prerequisites. You gain a +1 circumstance bonus to Nature checks to Handle a goblin dog or wolf mount. For more about the Nature skill, see page 152.",
                    "feat_frequency" : "",
                    "feat_special" : "",
                    "feat_max_stacks" : 1
                },
                {
                    "feat_name" : "Very Sneaky",
                    "feat_level" : 1,
                    "acting_and_effects" : "",
                    "feat_trait" : "Goblin",
                    "feat_prerequisits" : "",
                    "feat_trigger" : "",
                    "feat_description" : "Taller folk rarely pay attention to the shadows at their feet, and you take full advantage of this. You can move 5 feet farther when you take the Sneak action, up to your Speed (see page 158). In addition, if you critically succeed at a Stealth check against a creature and then attack that creature, your target remains flat-footed during your attack. The GM doesn’t reveal that your Stealth check resulted in a critical success until you declare your attack.",
                    "feat_frequency" : "",
                    "feat_special" : "",
                    "feat_max_stacks" : 1
                },
                {
                    "feat_name" : "Weapon Familiarity (Goblin)",
                    "feat_level" : 1,
                    "acting_and_effects" : "",
                    "feat_trait" : "Goblin",
                    "feat_prerequisits" : "",
                    "feat_trigger" : "",
                    "feat_description" : "Others might look upon them with disdain, but you know that the weapons of your people are as effective as they are sharp. You are trained with the dogslicer and horsechopper. In addition, you gain access to all uncommon goblin weapons. For the purpose of proficiencies, you treat martial goblin weapons as simple weapons and exotic goblin weapons as martial weapons. For more information about weapons, see page 178.",
                    "feat_frequency" : "",
                    "feat_special" : "",
                    "feat_max_stacks" : 1
                },
                {
                    "feat_name" : "Weapon Frenzy (Goblin)",
                    "feat_level" : 5,
                    "acting_and_effects" : "",
                    "feat_trait" : "Goblin",
                    "feat_prerequisits" : "Weapon Familiarity (Goblin)",
                    "feat_trigger" : "",
                    "feat_description" : "You can wield your people’s weapons of choice as well as any elf brandishes a longsword or dwarf swings a warhammer. Whenever you critically hit using a goblin weapon, you apply the weapon’s critical specialization effect.",
                    "feat_frequency" : "",
                    "feat_special" : "",
                    "feat_max_stacks" : 1
                }
            ],
            "halfling": [
                {
                    "feat_name" : "Attentive",
                    "feat_level" : 1,
                    "acting_and_effects" : "",
                    "feat_trait" : "Halfling",
                    "feat_prerequisits" : "",
                    "feat_trigger" : "",
                    "feat_description" : "Your communal lifestyle causes you to notice when those around you act out of character. You gain a +2 circumstance bonus to Perception checks when using the Seek action to notice enchanted or possessed characters. If you aren’t Seeking, the GM rolls a secret check anyway, with a –2 circumstance penalty, for you to notice the enchantment or possession.",
                    "feat_frequency" : "",
                    "feat_special" : "",
                    "feat_max_stacks" : 1
                },
                {
                    "feat_name" : "Distracting Shadows",
                    "feat_level" : 1,
                    "acting_and_effects" : "",
                    "feat_trait" : "Halfling",
                    "feat_prerequisits" : "",
                    "feat_trigger" : "",
                    "feat_description" : "You’ve learned to use larger folk to avoid drawing attention to yourself. You can use creatures that are at least one size larger than you (usually Medium or larger) as cover for the Hide and Sneak actions (see page 158).",
                    "feat_frequency" : "",
                    "feat_special" : "",
                    "feat_max_stacks" : 1
                },
                {
                    "feat_name" : "Keen Eyes",
                    "feat_level" : 1,
                    "acting_and_effects" : "",
                    "feat_trait" : "Halfling, Heritage",
                    "feat_prerequisits" : "",
                    "feat_trigger" : "",
                    "feat_description" : "Your eyes are sharp, and your other senses are similarly attuned to your surroundings. When you attack an opponent that is concealed from you or sensed by you, reduce the flat check DC you need to hit that creature to 3 for concealed or 9 for sensed. You gain a +2 circumstance bonus when using the Seek action to sense unseen creatures within 30 feet.",
                    "feat_frequency" : "",
                    "feat_special" : "",
                    "feat_max_stacks" : 1
                },
                {
                    "feat_name" : "Lucky Halfling",
                    "feat_level" : 1,
                    "acting_and_effects" : "Free Action",
                    "feat_trait" : "Fortune, Halfling",
                    "feat_prerequisits" : "",
                    "feat_trigger" : "You fail a skill check or saving throw.",
                    "feat_description" : "Your happy-go-lucky nature makes it seem like misfortune avoids you, and to an extent, that’s true. You can reroll the triggering check or saving throw and take the better of the two results.",
                    "feat_frequency" : "once per day",
                    "feat_special" : "",
                    "feat_max_stacks" : 1
                },
                {
                    "feat_name" : "Plucky",
                    "feat_level" : 1,
                    "acting_and_effects" : "",
                    "feat_trait" : "Halfling",
                    "feat_prerequisits" : "",
                    "feat_trigger" : "",
                    "feat_description" : "You are easily able to ward off attempts to play on your fears and emotions. If you succeed at a saving throw against an emotion or fear effect, treat your result as a critical success instead of a success.",
                    "feat_frequency" : "",
                    "feat_special" : "",
                    "feat_max_stacks" : 1
                },
                {
                    "feat_name" : "Sure-Footed",
                    "feat_level" : 1,
                    "acting_and_effects" : "",
                    "feat_trait" : "Halfling",
                    "feat_prerequisits" : "",
                    "feat_trigger" : "",
                    "feat_description" : "If you succeed at an Acrobatics check to Balance or an Athletics check to Climb, you get a critical success instead of a success. You’re not flat-footed when you attempt to Balance or Climb. For more about these skills and their uses, see pages 144 and 146, respectively.",
                    "feat_frequency" : "",
                    "feat_special" : "",
                    "feat_max_stacks" : 1
                },
                {
                    "feat_name" : "Titan Slinger",
                    "feat_level" : 1,
                    "acting_and_effects" : "",
                    "feat_trait" : "Halfling",
                    "feat_prerequisits" : "",
                    "feat_trigger" : "",
                    "feat_description" : "You have learned how to use your sling to fell big creatures. You gain a +1 circumstance bonus to damage rolls with slings against Large or larger creatures. This bonus increases to +2 on critical hits (and then doubles on a critical hit as normal).",
                    "feat_frequency" : "",
                    "feat_special" : "",
                    "feat_max_stacks" : 1
                },
                {
                    "feat_name" : "Unfettered",
                    "feat_level" : 1,
                    "acting_and_effects" : "Reaction",
                    "feat_trait" : "Halfling",
                    "feat_prerequisits" : "",
                    "feat_trigger" : "You roll an Acrobatics check to Escape, an Athletics check to Break a Grapple, or a saving throw against an effect that would entangle or grab you, or you use your Fortitude DC to resist a Grapple.",
                    "feat_description" : "You were forced into service as a laborer, either pressed into indenture or shackled by the evils of slavery, but you’ve since escaped and have trained to ensure you’ll never labor against your will again. You gain a +2 circumstance bonus to the triggering check or your Fortitude DC.",
                    "feat_frequency" : "",
                    "feat_special" : "",
                    "feat_max_stacks" : 1
                },
                {
                    "feat_name" : "Weapon Familiarity (Halfling) ",
                    "feat_level" : 1,
                    "acting_and_effects" : "",
                    "feat_trait" : "Halfling",
                    "feat_prerequisits" : "",
                    "feat_trigger" : "",
                    "feat_description" : "You favor traditional halfling weapons. You are trained with slings, sling staves, and shortswords. In addition, you gain access to all uncommon halfling weapons. For the purpose of proficiencies, you treat martial halfling weapons as simple weapons and exotic halfling weapons as martial weapons. For more information about weapons, see page 178.",
                    "feat_frequency" : "",
                    "feat_special" : "",
                    "feat_max_stacks" : 1
                },
                {
                    "feat_name" : "Weapon Trickster (Halfling)",
                    "feat_level" : 5,
                    "acting_and_effects" : "",
                    "feat_trait" : "Halfling",
                    "feat_prerequisits" : "Weapon Familiarity (Halfling)",
                    "feat_trigger" : "",
                    "feat_description" : "You are particularly adept at fighting with your people’s favored weapons. Whenever you critically succeed at an attack roll using a weapon of the sling group, a shortsword, or a halfling weapon, you apply the weapon’s critical specialization effect.",
                    "feat_frequency" : "",
                    "feat_special" : "",
                    "feat_max_stacks" : 1
                }
            ],
            "human": [
                {
                    "feat_name" : "Adapted Spell",
                    "feat_level" : 1,
                    "acting_and_effects" : "",
                    "feat_trait" : "Human",
                    "feat_prerequisits" : "You are a spellcaster.",
                    "feat_trigger" : "",
                    "feat_description" : "Study of multiple magical traditions reveals how to alter a spell to suit your spellcasting style. Choose one cantrip from a spell list other than your own. If you have a spell repertoire or spellbook, replace one of the cantrips you know or have in your spellbook with the chosen spell. If you prepare spells without a spellbook (if you’re a cleric or druid, for example), one of your cantrips must always be the chosen spell, and you prepare the rest normally. If you swap or retrain this cantrip later, you can choose its replacement from the same alternate list or a different one. For more about magic and spells, see page 192.",
                    "feat_frequency" : "",
                    "feat_special" : "",
                    "feat_max_stacks" : 1
                },
                {
                    "feat_name" : "Clever Improviser",
                    "feat_level" : 1,
                    "acting_and_effects" : "",
                    "feat_trait" : "Human",
                    "feat_prerequisits" : "",
                    "feat_trigger" : "",
                    "feat_description" : "You’ve learned how to handle situations when you’re out of your depth. You gain a +1 circumstance bonus to skill checks in which you’re untrained.",
                    "feat_frequency" : "",
                    "feat_special" : "",
                    "feat_max_stacks" : 1
                },
                {
                    "feat_name" : "Cooperative Nature",
                    "feat_level" : 1,
                    "acting_and_effects" : "",
                    "feat_trait" : "Human",
                    "feat_prerequisits" : "",
                    "feat_trigger" : "",
                    "feat_description" : "A short human life span lends perspective and has taught you from a young age to set aside differences and work together to achieve greatness. You gain a +2 circumstance bonus to your check when you use the Aid reaction or Assist action (see page 307).",
                    "feat_frequency" : "",
                    "feat_special" : "",
                    "feat_max_stacks" : 1
                },
                {
                    "feat_name" : "General Training",
                    "feat_level" : 1,
                    "acting_and_effects" : "",
                    "feat_trait" : "Human",
                    "feat_prerequisits" : "",
                    "feat_trigger" : "",
                    "feat_description" : "Your adaptability manifests in your mastery of a range of useful abilities. You gain a 1st-level general feat.",
                    "feat_frequency" : "",
                    "feat_special" : "You can select this feat multiple times, choosing a different feat each time.",
                    "feat_max_stacks" : 5
                },
                {
                    "feat_name" : "Half-Elf",
                    "feat_level" : 1,
                    "acting_and_effects" : "",
                    "feat_trait" : "Heritage, Human",
                    "feat_prerequisits" : "",
                    "feat_trigger" : "",
                    "feat_description" : "Either one of your parents was an elf, or one or both were half-elves. You have pointed ears and other telltale signs of elf heritage. You gain the elf trait. Select two of the following benefits: elven speed (increase your Speed by 5 feet), elven tongue (add Elven to your list of languages), gifted speaker (you are trained in Diplomacy), or low-light vision (you can see in dim light as well as you can in bright light). In addition, you can select elf, half-elf, and human feats whenever you gain an ancestry feat.",
                    "feat_frequency" : "",
                    "feat_special" : "You can select this feat twice. The second time, it loses the heritage trait and you gain the other two benefits.",
                    "feat_max_stacks" : 1
                },
                {
                    "feat_name" : "Half-Orc",
                    "feat_level" : 1,
                    "acting_and_effects" : "",
                    "feat_trait" : "Heritage, Human",
                    "feat_prerequisits" : "",
                    "feat_trigger" : "",
                    "feat_description" : "Either one of your parents was an orc, or one or both were half-orcs. You have a green tinge to your skin and other indicators of orc heritage. You gain the orc trait. Select two of the following benefits: intimidating visage (you are trained in Intimidation), low-light vision (you can see in dim light as well as you can in bright light), orc tongue (add Orcish to your list of languages), or orc toughness (gain 2 Hit Points). You can select orc, half-orc, and human feats whenever you gain an ancestry feat.",
                    "feat_frequency" : "",
                    "feat_special" : "You can select this feat twice. The second time, it loses the heritage trait and you gain the other two benefits.",
                    "feat_max_stacks" : 1
                },
                {
                    "feat_name" : "Haughty Obstinacy",
                    "feat_level" : 1,
                    "acting_and_effects" : "",
                    "feat_trait" : "Human",
                    "feat_prerequisits" : "",
                    "feat_trigger" : "",
                    "feat_description" : "Your powerful ego makes it harder for others to order you around. If you succeed at a saving throw against a mental effect that attempts to directly control your actions, you critically succeed instead. If a creature fails to Coerce you using the Intimidation skill (see page 150), it treats the result as a critical failure instead (so it can’t try to Coerce you again for 1 week).",
                    "feat_frequency" : "",
                    "feat_special" : "",
                    "feat_max_stacks" : 1
                },
                {
                    "feat_name" : "Natural Ambition",
                    "feat_level" : 1,
                    "acting_and_effects" : "",
                    "feat_trait" : "Human",
                    "feat_prerequisits" : "",
                    "feat_trigger" : "",
                    "feat_description" : "You were raised to be ambitious and always reach for the stars, causing you to progress quickly in your chosen field. You gain a 1st-level class feat for your class.",
                    "feat_frequency" : "",
                    "feat_special" : "",
                    "feat_max_stacks" : 1
                },
                {
                    "feat_name" : "Skilled",
                    "feat_level" : 1,
                    "acting_and_effects" : "",
                    "feat_trait" : "Human",
                    "feat_prerequisits" : "",
                    "feat_trigger" : "",
                    "feat_description" : "Your ingenuity allows you to train in a wide variety of skills. You become trained in two skills of your choice. For more about skills, see page 142.",
                    "feat_frequency" : "",
                    "feat_special" : "",
                    "feat_max_stacks" : 1
                },
                {
                    "feat_name" : "Unconventional Weaponry",
                    "feat_level" : 1,
                    "acting_and_effects" : "",
                    "feat_trait" : "Human",
                    "feat_prerequisits" : "",
                    "feat_trigger" : "",
                    "feat_description" : "You’ve familiarized yourself with a weapon from another ancestry or culture. You gain access to an uncommon weapon with an ancestry trait of your choice. This doesn’t change your proficiency for that weapon. For more about weapons, see page 178.",
                    "feat_frequency" : "",
                    "feat_special" : "",
                    "feat_max_stacks" : 1
                },
                {
                    "feat_name" : "Inspire Imitation",
                    "feat_level" : 5,
                    "acting_and_effects" : "",
                    "feat_trait" : "Half-Elf",
                    "feat_prerequisits" : "Half-Elf",
                    "feat_trigger" : "",
                    "feat_description" : "You inspire your allies to great feats through your own actions. Whenever you critically succeed at a skill check, you automatically qualify to take the Aid reaction when attempting to help an ally at the same skill check, even without spending an action to prepare to do so.",
                    "feat_frequency" : "",
                    "feat_special" : "",
                    "feat_max_stacks" : 1
                },
                {
                    "feat_name" : "Supernatural Charm",
                    "feat_level" : 5,
                    "acting_and_effects" : "",
                    "feat_trait" : "Half-Elf",
                    "feat_prerequisits" : "Half-Elf",
                    "feat_trigger" : "",
                    "feat_description" : "The elven magic in your blood manifests as magic that makes you more appealing or alluring. You can cast 1st-level charm as an innate arcane spell once per day. For more about magic and spells, see page 192.",
                    "feat_frequency" : "",
                    "feat_special" : "",
                    "feat_max_stacks" : 1
                },
                {
                    "feat_name" : "Orc Ferocity",
                    "feat_level" : 1,
                    "acting_and_effects" : "Reaction",
                    "feat_trait" : "Orc",
                    "feat_prerequisits" : "Half-Orc",
                    "feat_trigger" : "You’re reduced to 0 Hit Points.",
                    "feat_description" : "Fierceness in battle runs through your blood, and you refuse to fall from your injuries. When this feat is triggered, you avoid being knocked out and remain at 1 Hit Point.",
                    "feat_frequency" : "once per day",
                    "feat_special" : "",
                    "feat_max_stacks" : 1
                },
                {
                    "feat_name" : "Orc Sight",
                    "feat_level" : 5,
                    "acting_and_effects" : "",
                    "feat_trait" : "Half-Orc",
                    "feat_prerequisits" : "Half-Orc",
                    "feat_trigger" : "",
                    "feat_description" : "Your orc blood is strong enough to grant you the keen vision of your orc forebears. You gain low-light vision, allowing you to see in dim light just as well as you can in bright light. If you have low-light vision (from the Half-Orc feat), you instead gain darkvision, allowing you to see in darkness and dim light just as well as you can in bright light. Your vision in darkness is in black and white.",
                    "feat_frequency" : "",
                    "feat_special" : "",
                    "feat_max_stacks" : 1
                },
                {
                    "feat_name" : "Orc Weapon Carnage",
                    "feat_level" : 5,
                    "acting_and_effects" : "",
                    "feat_trait" : "Orc",
                    "feat_prerequisits" : ["Half-Orc", "Orc Weapon Familiarity"],
                    "feat_trigger" : "",
                    "feat_description" : "You are brutally efficient with the weapons of your orc ancestors. Whenever you critically hit using a two-handed weapon of the axe or sword group, or with an orc weapon, you apply the weapon’s critical specialization effect.",
                    "feat_frequency" : "",
                    "feat_special" : "",
                    "feat_max_stacks" : 1
                },
                {
                    "feat_name" : "Orc Weapon Familiarity",
                    "feat_level" : 1,
                    "acting_and_effects" : "",
                    "feat_trait" : "Orc",
                    "feat_prerequisits" : "Half-Orc",
                    "feat_trigger" : "",
                    "feat_description" : "You favor the brutal weapons of your orc ancestors. You are trained with the greataxe and falchion. In addition, you gain access to all uncommon orc weapons. For the purpose of proficiencies, you treat martial orc weapons as simple weapons and exotic orc weapons as martial weapons. For more about weapons, see page 178.",
                    "feat_frequency" : "",
                    "feat_special" : "",
                    "feat_max_stacks" : 1
                },
                {
                    "feat_name" : "Superstition",
                    "feat_level" : 1,
                    "acting_and_effects" : "1 Action",
                    "feat_trait" : "Concentrate, Orc",
                    "feat_prerequisits" : "Half-Orc",
                    "feat_trigger" : "",
                    "feat_description" : "Orcs have a distrust of magic, and you have picked up these misgivings. You seek inner strength from your superstitions, granting you a +1 circumstance bonus to saves against spells and other magical effects until the start of your next turn.",
                    "feat_frequency" : "",
                    "feat_special" : "",
                    "feat_max_stacks" : 1
                }
            ]
        }
    ]
}
